Repository: PerfectXL/PerfectXL-Rubberduck
Catalog: Rubberduck/Rubberduck.SourceControl/SourceControlText.*.resx
Languages: de

# GitBranchDeleteFailed
source: Branch deletion failed.
de: Das Löschen des Zweiges ist fehlgeschlagen.

# GitCheckoutFailed
source: Checkout failed.
de: Das Auschecken ist fehlgeschlagen.

# GitCommitFailed
source: Commit failed.
de: Commit fehlgeschlagen.

# GitFetchFailed
source: Fetch failed.
de: Fetch fehlgeschlagen.

# GitFileStageFailed
source: Failed to stage file.
de: Staging der Datei fehlgeschlagen.

# GitFileStageFailedMsg
source: Failed to stage file '{0}'
de: Staging der Datei' {0}' ist fehlgeschlagen.

# GitNewBranchFailed
source: Branch creation failed.
de: Die Erzeugung des Zweiges ist fehlgeschlagen.

# GitNoInitialCommit
source: Unable to perform initial commit.
de: Der initiale Commit konnte nicht ausgeführt werden.

# GitNotInit
source: Unable to initialize repository.
de: Das Repository konnte nicht initialisiert werden.

# GitPublishFailed
source: Publish failed.
de: Veröffentlichung fehlgeschlagen.

# GitPullFailed
source: Pull failed.
de: Pull fehlgeschlagen.

# GitPushFailed
source: Push failed.
de: Push fehlgeschlagen.

# GitRemoveFileStaging
source: Failed to remove file '{0}' from staging area.
de: Das Entfernen der Datei '{0}' aus dem Stagingbereich ist fehlgeschlagen.

# GitRepoNotCloned
source: Failed to clone remote repository.
de: Das entfernte Repository konnte nicht geklont werden.

# GitRepoNotFound
source: Repository not found.
de: Repository konnte nicht gefunden werden.

# GitRepoStatusFailed
source: Failed to retrieve repository status.
de: Der Status des Repository konnte nicht aktualisiert werden.

# GitRevertConflict
source: Revert resulted in conflicts. Revert failed.
de: Revert führt zu einem Konflikt. Revert fehlgeschlagen.

# GitRevertFailed
source: Revert failed.
de: Revert fehlgeschlagen.

# GitUndoFailed
source: Undo failed.
de: Rückgängig machen fehlgeschlagen.

# GitUnpublishFailed
source: Unpublish failed.
de: Unpublish fehlgeschlagen.

# NoProjectOpen
source: There must be an active project for Rubberduck to successfully initialize a repository.
de: There must be a project open for Rubberduck to successfully initialize a repository.
