Repository: PerfectXL/PerfectXL-Rubberduck
Catalog: Rubberduck.Resources/UnitTesting/AssertMessages.*.resx
Languages: cs, es

# Assert_DimensionMismatchFormat
source: expected has {0} dimensions; actual has {1} dimensions. {2}
cs: očekáváné má {0} dimenzí; aktuální má {1} dimensí. {2}
es: esperado tiene {0} dimensiones; real tiene {1} dimensiones. {2}

# Assert_EasterEggAssertClassPassed
source: OK, Rubberduck asserted. Now what?
cs: OK. Rubberduck je assertován. Co teď?
es: OK, afirmó Rubberduck. ¿Ahora que?

# Assert_EasterEggIFakePassed
source: Expected: Stack overflow?; Actual: Guard clause.
cs: Očekáváno: Stack overflow?; Aktuální: Ochranná doložka.
es: Esperado: desbordamiento de pila ?; Actual: cláusula de guardia.

# Assert_EasterEggIVerifyPassed
source: IVerify too.
cs: IVerify také.
es: IVerify también.

# Assert_FailedMessageFormat
source: {0} assertion failed. {1}
cs: {0} assert zkouška selhala. {1}
es: La afirmación {0} ha fallado. {1}

# Assert_InvalidFakePassThrough
source: Invalid setup of IFake {0}. PassThrough property must be False.
cs: Nesprávné nastavení IFake {0}. PassThrough vlastnost musí být False.
es: Configuración inválida de IFake {0}. La propiedad PassThrough debe ser False.

# Assert_LBoundMismatchFormat
source: Dimension {0}: expected has an LBound of {1}; actual has an LBound of {2}. {3}
cs: Rozměr {0}: očekávána hodnota LBound {1}; aktuální hodnota LBound {2}. {3}
es: Dimensión {0}: se espera que tenga un LBound de {1}; actualmente tiene un LBound de {2}. {3}

# Assert_NotImplemented
source: Not implemented.
cs: Není implementováno.
es: No se ha implementado.

# Assert_ParameterIsNotArrayFormat
source: {0} is not an array.
cs: {0} není typu pole.
es: {0} no es un arreglo.

# Assert_ParameterResultFormat
source: Expected: {0}; Actual: {1}. {2}
cs: Očekáváno: {0}; Aktuální: {1}. {2}
es: Esperado: {0}; Actual: {1}. {2}

# Assert_ReferenceValueMismatch
source: [expected] is a reference type and [actual] is a value type.
cs: [očekáváno] je typu reference a [aktuální] je typu hodnota.
es: [esperado] es un tipo de referencia y [real] es un tipo de valor.

# Assert_UBoundMismatchFormat
source: Dimension {0}: expected has a UBound of {1}; actual has a UBound of {2}. {3}
cs: Rozměr {0}" očekávána hodnota UBound {1}; aktuální hodnota UBound {2}. {3}
es: Dimensión {0}: se espera que tenga un UBound de {1}; real tiene un límite de {2}. {3}

# Assert_UnexpectedArrayFormat
source: [expected] and [actual] are arrays. Consider using {0}.
cs: [očekáváno] a [aktuální] jsou typu pole. Zvažte použití {0}.
es: [esperado] y [actual] son arreglos. Considera utilizar {0}.

# Assert_UnexpectedNullArraysFormat
source: [expected] and [actual] are Nothing. Consider using {0}.
cs: [očekáváno] a [aktuální] jsou "Nothing". Zvažte použití {0}.
es: [esperado] y [actual] son Nada. Considera utilizar {0}.

# Assert_UnexpectedReferenceComparisonFormat
source: [expected] and [actual] are reference types. Consider using {0}.
cs: [očekáváno] a [aktuální] jsou typu reference. Zvažte použití {0}.
es: [esperado] y [actual] son tipos de referencia. Considera utilizar {0}.

# Assert_UnexpectedValueComparisonFormat
source: [expected] and [actual] are value types. Consider using {0}.
cs: [očekáváno] a [aktuální] jsou typu hodnota. Zvažte použití {0}.
es: [esperado] y [real] son tipos de valor. Considera utilizar {0}.

# Assert_VerifyNoInvocationFormat
source: No matching invocation for parameter {0}; Only {1} invocations. {2}
cs: Žádná odpovídající volání parametru {0}; Pouze {1} volání. {2}
es: No hay invocación coincidente para el parámetro {0}; Sólo {1} invocaciones. {2}

# Assert_VerifyParameterNonNumeric
source: Parameter {0} was not a numeric value on invocation {1}. {2}
cs: Parametr {0} nebyl u volání {1} číselná hodnota. {2}
es: El parámetro {0} no era un valor numérico en la invocación {1}. {2}

# Assert_VerifyParameterNotPassed
source: Parameter {0} was not passed on invocation {1}. {2}
cs: Parametr {0} nebyl u volání {1} předán. {2}
es: El parámetro {0} no se pasó en la invocación {1}. {2}

# Assert_ValueReferenceMismatch
source: [expected] is a value type and [actual] is a reference type.
cs: [očekáváno] je typu hodnota a [aktuální] je typu reference.
es: [esperado] es un tipo de valor y [real] es un tipo de referencia.

# Assert_MismatchedTypes
source: [expected] and [actual] values are not the same type.
cs: [očekáváno] a [aktuální] hodnoty nejsou stejného typu.
es: Los valores [esperado] y [real] no son del mismo tipo.

# Assert_NeitherParameterIsArray
source: Neither [expected] or [actual] is an array.
cs: Ani [očekáváno] nebo [aktuální] nejsou typu pole.
es: Ni [esperado] ni [real] son arreglos.

# Assert_VerifyInternalErrorMessage
source: Rubberduck could not process the invocation results.
cs: Rubberduck nebyl schopen zpracovat výsledky volání.
es: Rubberduck no pudo procesar los resultados de invocación.

# Prerequisite_EarlyBindingReferenceMissing
source: The Reference to Rubberduck required for early-binding tests could not be resolved. It may be corrupt.
cs: Reference, které Rubberduck potřebuje pro testy časných-vazeb, nemůžou být vyřešeny. Je možné, že jsou poškozeny.
es: La referencia a Rubberduck requerida para las pruebas de unión temprana no se pudo resolver. Puede estar corrupta.

# TestRunner_ComException
source: Unexpected COM exception while running tests.
cs: Při běhu testů se vyskytla neočekávaná COM výjimka.
es: Excepción de COM inesperada al ejecutar pruebas.

# TestRunner_ExceptionDuringRun
source: Running a test method failed with an exception.
cs: Spuštěná testovací metoda skončila výjimkou.
es: La ejecución de un método de prueba falló con una excepción.

# TestRunner_GenericException
source: Unexpected exception while running tests.
cs: Při běhu testů se vyskytla neočekávaná výjimka.
es: Excepción inesperada al ejecutar pruebas.

# TestRunner_ModuleInitializeFailure
source: Something went wrong when trying to run @ModuleInitialize. Module skipped.
cs: Neznámý problém při pokusu spustit @ModuleInitialize. Modul přeskočen.
es: Algo salió mal al intentar ejecutar @ModuleInitialize. Se saltó el módulo.

# TestRunner_TestInitializeFailure
source: Something went wrong when trying to run @TestInitialize. Test skipped.
cs: Neznámý problém při pokusu spustit @TestInitialize. Test přeskočen.
es: Algo salió mal al intentar ejecutar @TestInitialize. Prueba saltada.
