Repository: PerfectXL/PerfectXL-Rubberduck
Catalog: Rubberduck.Resources/RegexAssistant/RegexAssistantUI.*.resx
Languages: cs, es, fr

# AtomDescription_CarriageReturn
source: Matches the ASCII character 'CR' (carriage return)
cs: Odpovídá ASCII znaku CR
es: Coincide con el carácter ASCII CR
fr: Correspond au caractère ASCII 'CR' (carriage return)

# AtomDescription_CharacterClass
source: Matches any of the following characters: {0}
cs: Odpovídá jakémukoli z následujících znaků: {0}
es: Coincide con cualquiera de los siguientes caracteres: {0}
fr: Correspond à l'un des caractères suivants: {0}

# AtomDescription_CharacterClass_Inverted
source: Matches any character that is not one of: {0}
cs: Odpovídá jakémukoli znaku, který není jeden z následujících: {0}
es: Coincide con cualquier carácter que no sea uno de: {0}
fr: Correspond à un caractère qui n'est pas dans la liste: {0}

# AtomDescription_Digit
source: Matches any digit. Equivalent to "[0-9]"
cs: Odpovídá jakémukoli číslu. Ekvivalentní k "[0-9]"
es: Coincide con cualquier dígito. Equivalente a "[0-9]"
fr: Correspond à un chiffre. Équivalent à "[0-9]"

# AtomDescription_Dot
source: Matches any character
cs: Odpovídá jakémukoli znaku
es: Coincide con cualquier carácter
fr: Correspond à tout caractère

# AtomDescription_FormFeed
source: Matches the ASCII character 'FF' (form feed)
cs: Odpovídá "Form-Feed"-znaku
es: Coincide con el carácter "Form-Feed"
fr: Correspond au caractère ASCII 'FF' (line feed)

# AtomDescription_Group
source: Matches a capture group '{0}'
cs: Odpovídá zachycené skupině '{0}'
es: Coincide con un grupo de captura '{0}'
fr: Correspond au groupe de capture '{0}'

# AtomDescription_HTab
source: Matches the ASCII character 'HT' (horizontal tab)
cs: Odpovídá horizontálnímu "Tab"-znaku
es: Coincide con el carácter "Tab" horizontal
fr: Correspond au caractère ASCII 'HT' (horizontal tab)

# AtomDescription_Literal_ActualLiteral
source: Matches literal '{0}'
cs: Odpovídá písmenu '{0}'
es: Coincide con el literal '{0}'
fr: Correspond à la chaîne litérale '{0}'

# AtomDescription_Literal_Backreference
source: Exactly matches what the capture group at position {0} matched again
cs: Naprosto přesně odpovídá tomu, co odpovídá zachycené skupině na pozici {0}
es: Coincide exactamente con el grupo de captura en la posición {0} vuelve a coincidir
fr: Correspond à nouveau au groupe de capture à la position {0}

# AtomDescription_Literal_EscapedLiteral
source: Matches the escaped literal {0}
cs: Odpovídá únikovému písmenu {0}
es: Coincide con el literal de escape {0}
fr: Correspond à la chaîne litérale '{0}'

# AtomDescription_Literal_HexCodepoint
source: Matches the Hexadecimal ASCII value {0}
cs: Odpovídá Hexadecimální ASCII hodnotě {0}
es: Coincide con el valor hexadecimal ASCII {0}
fr: Correspond au caractère ASCII {0} (hexadécimal)

# AtomDescription_Literal_OctalCodepoint
source: Matches the Octal ASCII value {0}
cs: Odpovídá Oktálové ASCII hodnotě {0}
es: Coincide con el valor ASCII octal {0}
fr: Correspond au caractère ASCII {0} (octal)

# AtomDescription_Literal_UnicodePoint
source: Matches the Unicode Codepoint {0}
cs: Odpovídá Unicode-Codepointu {0}
es: Coincide con el punto de código de Unicode {0}
fr: Correspond au point de code Unicode {0}

# AtomDescription_Newline
source: Matches the ASCII character 'LF' (line feed)
cs: Odpovídá ASCII znaku LF, který je také znám jako "nový řádek"
es: Coincide con el carácter ASCII LF, también conocido como nueva línea
fr: Correspond au caractère ASCII 'LF' (line feed)

# AtomDescription_NonDigit
source: Matches non-digits. Equivalent to "[^\d]"
cs: Odpovídá čemukoli, co není číslo. Ekvivalentní k "[^\d]"
es: Coincide con los no dígitos. Equivalente a "[^\d]"
fr: Correspond à tout caractère non-numérique. Équivalent à "[^\d]"

# AtomDescription_NonWhitespace
source: Matches non-whitespace characters. Equivalent to "[^\s]"
cs: Odpovídá čemukoli, co není znak mezery. Ekvivalentní k "[^\s]"
es: Coincide con los caracteres que no son espacios en blanco. Equivalente a "[^\s]"
fr: Correspond à tout caractère qui n'est pas d'espacement. Équivalent à "[^\s]"

# AtomDescription_NonWordBoundary
source: Ensures that the current position is at a "non-word-boundary"
cs: Zajistí, že je aktuální pozice na "okraji ne-slova"
es: Asegura que la posición actual no esté en un "límite de palabra"
fr: Correspond à toute position qui n'est pas à la limite d'un "mot"

# AtomDescription_NonWordCharacter
source: Matches "non-word characters". Equivalent to "[^\w]"
cs: Odpovídá "není-slovo znaku". Ekvivalentní k "[^\w]"
es: Coincide con "caracteres que no son palabras". Equivalente a "[^\w]"
fr: Correspond à tout caractère "non-mot". Équivalent à "[^\w]"

# AtomDescription_VTab
source: Matches the ASCII character 'VT' (vertical tab)
cs: Odpovídá vertikálnímu "Tab"-znaku
es: Coincide con el carácter "Tab" vertical
fr: Correspond au caractère ASCII 'VT' (vertical tab)

# AtomDescription_Whitespace
source: Matches any whitespace character. Equivalent to "[ \t\r\n\v\f]"
cs: Odpovídá jakémukoli znaku mezery. Ekvivalentní k "[ \t\r\n\v\f]"
es: Coincide con cualquier carácter de espacio en blanco. Equivalente a "[\t\r\n\v\f]"
fr: Correspond tout caractère d'espacement. Équivalent à "[ \t\r\n\v\f]"

# AtomDescription_WordBoundary
source: Ensures that the current position is at a "word boundary"
cs: Zajistí, že je aktuální pozice na "okraji slova"
es: Asegura que la posición actual esté en un "límite de palabra"
fr: Correspond à toute position à la limite d'un "mot"

# AtomDescription_WordCharacter
source: Matches any "word character". Equivalent to "[a-zA-Z_0-9]"
cs: Odpovídá jakémukoli "slovnímu znaku". Ekvivalentní k "[a-zA-Z_0-9]"
es: Coincide con cualquier "carácter de la palabra". Equivalente a "[a-zA-Z_0-9]"
fr: Correspond à tout caractère de "mot". Équivalent à "[a-zA-Z_0-9]"

# ExpressionDescription_AlternativesExpression
source: Matches one of {0} alternatives
cs: Odpovídá jedné z {0} alternativ
es: Coincide con una de {0} alternativas
fr: Correspond à l'une de {0} alternatives

# ExpressionDescription_ConcatenatedExpression
source: Matches literal sequence
cs: Odpovídá písmenové sekvenci
es: Coincide con la secuencia literal
fr: Correspond à une séquence litérale

# ExpressionDescription_ErrorExpression
source: Could not parse '{0}' as literal.
cs: Nebylo možné zpracovat '{0}' jako písmeno. Prosím, zkontrolujte zadaný text.
es: No se pudo analizar '{0}' como literal.
fr: Impossible d'analyser '{0}' en tant que chaîne littérale.

# PatternDescription_AnchorEnd
source: $ ensures all characters of the string are consumed
cs: $ zajistí, že jsou veškeré znaky řetězce zkonzumovány
es: $ asegura que todos los caracteres de la cadena son consumidos
fr: Ancrage de la fin de la correspondance à la fin de l'entrée (input)

# PatternDescription_AnchorEnd_GlobalEnabled
source: $ ensures that the line ended or all characters of the input have been consumed
cs: $ zajistí, že skončil řádek, nebo že byly všechny zadané znaky zkonzumovány
es: $ garantiza que la línea terminada o todos los caracteres de la entrada hayan sido consumidos
fr: Ancrage de la fin de la correspondance à la fin d'une ligne de l'entrée (input)

# PatternDescription_AnchorStart
source: ^ ensures we are at the beginning of the string that's to be matched
cs: ^ zajistí, že jsme na začátku řetězce, který bude zpracováván
fr: Ancrage du début de la correspondance au début de l'entrée (input)

# PatternDescription_AnchorStart_GlobalEnabled
source: ^ ensures that the matcher starts at the beginning of a line
cs: ^ zajistí, že zpracování začne na začátku řádku
es: ^ asegura que el emparejador comience al principio de una línea
fr: Ancrage du début de la correspondance au début d'une ligne de l'entrée (input)

# PatternDescription_IgnoreCase
source: All matches ignore the case (upper or lower) of literals
cs: Veškeré nalezené výsledky ignorují velikost (horní nebo dolní) písmen
es: Todas las coincidencias ignoran mayúsculas/minúsculas en los literales
fr: Toutes les correspondances ignorent la casse (minuscules/majuscules) des chaînes litérales

# Quantifer_Plus
source: at least once (1+)
cs: alespoň jednou
es: al menos una vez (1+)
fr: au moins une fois (1+)

# Quantifier_Asterisk
source: any number of times (0+)
cs: libovolněkrát
es: cualquier cantidad de veces (0+)
fr: un nombre de fois indéterminé (0+)

# Quantifier_ClosedRange
source: between {0} and {1} times
cs: mezi {0} a {1} krát
es: entre {0} y {1} veces
fr: entre {0} et {1} fois

# Quantifier_Exact
source: exactly {0} times
cs: přesně {0} krát
es: exactamente {0} veces
fr: exactement {0} fois

# Quantifier_None
source: exactly once (1)
cs: přesně jednou
es: exactamente una vez (1)
fr: exactement une fois (1)

# Quantifier_OpenRange
source: at least {0} times
cs: alespoň {0} krát
es: al menos {0} veces
fr: au moins {0} fois

# Quantifier_Optional
source: at most once (1-)
cs: maximálně jednou
es: como máximo una vez (1-)
fr: une fois, au plus (1-)
